_posts/2022-02-03-boj-11657.html
---
title: BOJ 11657 타임머신
tags: 최단거리
---

<div id="outline-container-orgbce39f8" class="outline-2">
<h2 id="orgbce39f8">BOJ 11657 타임머신</h2>
<div class="outline-text-2" id="text-orgbce39f8">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>

<div id="outline-container-org207918b" class="outline-2">
<h2 id="org207918b">접근하기</h2>
<div class="outline-text-2" id="text-org207918b">
<pre class="example">
음의 간선이 있는 그래프의 최단거리 구하기 - 벨만포드 알고리즘

음의 cycle이 있는지 여부 파악이 가능함
</pre>
</div>
</div>

<div id="outline-container-org52ff7ca" class="outline-2">
<h2 id="org52ff7ca">코드</h2>
<div class="outline-text-2" id="text-org52ff7ca">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">vector</span> &lt; <span style="color: #8ae234; font-weight: bold;">pair</span>&lt; <span style="color: #8ae234; font-weight: bold;">pair</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">int</span> &gt;, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; &gt; <span style="color: #ff6347;">edge</span>;
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">dp</span>[501];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">bf</span>()
{
    dp[1] = 0;      <span style="color: #888a85;">// </span><span style="color: #888a85;">&#49884;&#51089;&#51216;</span>
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N-1;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp;<span style="color: #ff6347;">o</span> : edge) {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">from</span> = o.first.first;
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">to</span> = o.first.second;
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cost</span> = o.second;

            <span style="color: #729fcf; font-weight: bold;">if</span> (dp[from] == INF) <span style="color: #729fcf; font-weight: bold;">continue</span>;
            <span style="color: #729fcf; font-weight: bold;">if</span> (dp[to] &gt; dp[from] + cost) {
                dp[to] = dp[from] + cost;
            } 
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cycle_check</span>()
{
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp;<span style="color: #ff6347;">o</span> : edge) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">from</span> = o.first.first;
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">to</span> = o.first.second;
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cost</span> = o.second;

        <span style="color: #729fcf; font-weight: bold;">if</span> (dp[from] == INF) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span> (dp[to] &gt; dp[from] + cost) {
            dp[to] = dp[from] + cost;
            <span style="color: #729fcf; font-weight: bold;">return</span> <span style="color: #8ae234;">true</span>;
        } 
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> <span style="color: #8ae234;">false</span>;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
    <span style="color: #ff6347;">cin</span> &gt;&gt; N &gt;&gt; M;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        dp[i] = INF;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>, <span style="color: #ff6347;">cost</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        cin &gt;&gt; p1 &gt;&gt; p2 &gt;&gt; cost;
        edge.push_back({p1, p2}, cost);
    }

    bf();
    <span style="color: #729fcf; font-weight: bold;">if</span> (cycle_check()) {
        cout &lt;&lt; -1 &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i&lt;=N;i++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (dp[i] != INF)
                cout &lt;&lt; dp[i] &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
            <span style="color: #729fcf; font-weight: bold;">else</span>
                cout &lt;&lt; -1 &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e36a92" class="outline-2">
<h2 id="org1e36a92">문제 링크</h2>
<div class="outline-text-2" id="text-org1e36a92">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/11657">https://www.acmicpc.net/problem/11657</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8309855" class="outline-2">
<h2 id="org8309855">이론해설</h2>
<div class="outline-text-2" id="text-org8309855">
<ul class="org-ul">
<li><a href="https://yabmoons.tistory.com/365">https://yabmoons.tistory.com/365</a></li>
<li><a href="https://developer-davii.tistory.com/89">https://developer-davii.tistory.com/89</a></li>
</ul>
</div>
</div>
